espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_i3c.h
/*
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef _FSL_I3C_H_
#define _FSL_I3C_H_

#include <stddef.h>
#include "fsl_device_registers.h"
#include "fsl_common.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @addtogroup i3c
 * @{
 */

/*! @name Driver version */
/*@{*/
/*! @brief I3C driver version 2.0.0. */
#define FSL_I3C_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/*! @brief Timeout times for waiting flag. */
#ifndef I3C_WAIT_TIMEOUT
#define I3C_WAIT_TIMEOUT 0U /* Define to zero means keep waiting until the flag is assert/deassert. */
#endif

/*! @brief I3C status return codes. */
enum _i3c_status
{
    kStatus_I3C_Busy = MAKE_STATUS(kStatusGroup_I3C, 0), /*!< The master is already performing a transfer. */
    kStatus_I3C_Idle = MAKE_STATUS(kStatusGroup_I3C, 1), /*!< The slave driver is idle. */
    kStatus_I3C_Nak  = MAKE_STATUS(kStatusGroup_I3C, 2), /*!< The slave device sent a NAK in response to an address. */
    kStatus_I3C_WriteAbort =
        MAKE_STATUS(kStatusGroup_I3C, 3), /*!< The slave device sent a NAK in response to a write. */
    kStatus_I3C_Term           = MAKE_STATUS(kStatusGroup_I3C, 4), /*!< The master terminates slave read. */
    kStatus_I3C_ParityError    = MAKE_STATUS(kStatusGroup_I3C, 5), /*!< Parity error from DDR read. */
    kStatus_I3C_CrcError       = MAKE_STATUS(kStatusGroup_I3C, 6), /*!< CRC error from DDR read. */
    kStatus_I3C_ReadFifoError  = MAKE_STATUS(kStatusGroup_I3C, 7), /*!< Read from MRDATAB register when FIFO empty. */
    kStatus_I3C_WriteFifoError = MAKE_STATUS(kStatusGroup_I3C, 8), /*!< Write to MWDATAB register when FIFO full. */
    kStatus_I3C_MsgError =
        MAKE_STATUS(kStatusGroup_I3C, 9), /*!< Message SDR/DDR mismatch or read/write message in wrong state */
    kStatus_I3C_InvalidReq = MAKE_STATUS(kStatusGroup_I3C, 10), /*!< Invalid use of request. */
    kStatus_I3C_Timeout    = MAKE_STATUS(kStatusGroup_I3C, 11), /*!< The module has stalled too long in a frame. */
};

/*! @} */

/*!
 * @addtogroup i3c_master_driver
 * @{
 */

/*!
 * @brief I3C master peripheral flags.
 *
 * The following status register flags can be cleared:
 * - #kI3C_MasterSlaveStartFlag
 * - #kI3C_MasterControlDoneFlag
 * - #kI3C_MasterCompleteFlag
 * - #kI3C_MasterArbitrationWonFlag
 * - #kI3C_MasterSlave2MasterFlag
 *
 * All flags except #kI3C_MasterBetweenFlag and #kI3C_MasterNackDetectFlag can be enabled as
 * interrupts.
 *
 * @note These enums are meant to be OR'd together to form a bit mask.
 */
enum _i3c_master_flags
{
    kI3C_MasterBetweenFlag        = I3C_MSTATUS_BETWEEN_MASK,   /*!< Between messages/DAAs flag */
    kI3C_MasterNackDetectFlag     = I3C_MSTATUS_NACKED_MASK,    /*!< NACK detected flag */
    kI3C_MasterSlaveStartFlag     = I3C_MSTATUS_SLVSTART_MASK,  /*!< Slave request start flag */
    kI3C_MasterControlDoneFlag    = I3C_MSTATUS_MCTRLDONE_MASK, /*!< Master request complete flag */
    kI3C_MasterCompleteFlag       = I3C_MSTATUS_COMPLETE_MASK,  /*!< Transfer complete flag */
    kI3C_MasterRxReadyFlag        = I3C_MSTATUS_RXPEND_MASK,    /*!< Rx data ready in Rx buffer flag */
    kI3C_MasterTxReadyFlag        = I3C_MSTATUS_TXNOTFULL_MASK, /*!< Tx buffer ready for Tx data flag */
    kI3C_MasterArbitrationWonFlag = I3C_MSTATUS_IBIWON_MASK,    /*!< Header address won arbitration flag */
    kI3C_MasterErrorFlag          = I3C_MSTATUS_ERRWARN_MASK,   /*!< Error occurred flag */
    kI3C_MasterSlave2MasterFlag   = I3C_MSTATUS_NOWMASTER_MASK, /*!< Switch from slave to master flag */
};

/*!
 * @brief I3C master error flags to indicate the causes.
 *
 * @note These enums are meant to be OR'd together to form a bit mask.
 */
enum _i3c_master_error_flags
{
    kI3C_MasterErrorNackFlag       = I3C_MERRWARN_NACK_MASK,    /*!< Slave NACKed the last address */
    kI3C_MasterErrorWriteAbortFlag = I3C_MERRWARN_WRABT_MASK,   /*!< Slave NACKed the write data */
    kI3C_MasterErrorTermFlag       = I3C_MERRWARN_TERM_MASK,    /*!< Master terminates slave read */
    kI3C_MasterErrorParityFlag     = I3C_MERRWARN_HPAR_MASK,    /*!< Parity error from DDR read */
    kI3C_MasterErrorCrcFlag        = I3C_MERRWARN_HCRC_MASK,    /*!< CRC error from DDR read */
    kI3C_MasterErrorReadFlag       = I3C_MERRWARN_OREAD_MASK,   /*!< Read from MRDATAB register when FIFO empty */
    kI3C_MasterErrorWriteFlag      = I3C_MERRWARN_OWRITE_MASK,  /*!< Write to MWDATAB register when FIFO full */
    kI3C_MasterErrorMsgFlag        = I3C_MERRWARN_MSGERR_MASK,  /*!< Message SDR/DDR mismatch or
            read/write message in wrong state */
    kI3C_MasterErrorInvalidReqFlag = I3C_MERRWARN_INVREQ_MASK,  /*!< Invalid use of request */
    kI3C_MasterErrorTimeoutFlag    = I3C_MERRWARN_TIMEOUT_MASK, /*!< The module has stalled too long in a frame */
};

/*! @brief I3C working master state. */
typedef enum _i3c_master_state
{
    kI3C_MasterStateIdle    = 0U, /*!< Bus stopped. */
    kI3C_MasterStateSlvReq  = 1U, /*!< Bus stopped but slave holding SDA low. */
    kI3C_MasterStateMsgSdr  = 2U, /*!< In SDR Message mode from using MWMSG_SDR. */
    kI3C_MasterStateNormAct = 3U, /*!< In normal active SDR mode. */
    kI3C_MasterStateDdr     = 4U, /*!< In DDR Message mode. */
    kI3C_MasterStateDaa     = 5U, /*!< In ENTDAA mode. */
    kI3C_MasterStateIbiAck  = 6U, /*!< Waiting on IBI ACK/NACK decision. */
    kI3C_MasterStateIbiRcv  = 7U, /*!< receiving IBI. */
} i3c_master_state_t;

/*! @brief I3C master enable configuration. */
typedef enum _i3c_master_enable
{
    kI3C_MasterOff     = 0U, /*!< Master off. */
    kI3C_MasterOn      = 1U, /*!< Master on. */
    kI3C_MasterCapable = 2U  /*!< Master capable. */
} i3c_master_enable_t;

/*! @brief I3C high keeper configuration. */
typedef enum _i3c_master_hkeep
{
    kI3C_MasterHighKeeperNone    = 0U, /*!< Use PUR to hold SCL high. */
    kI3C_MasterHighKeeperWiredIn = 1U, /*!< Use pin_HK controls. */
    kI3C_MasterPassiveSDA        = 2U, /*!< Hi-Z for Bus Free and hold SDA. */
    kI3C_MasterPassiveSDASCL     = 3U  /*!< Hi-Z both for Bus Free, and can Hi-Z SDA for hold. */
} i3c_master_hkeep_t;

/*! @brief Emits the requested operation when doing in pieces vs. by message. */
typedef enum _i3c_bus_request
{
    kI3C_RequestNone          = 0U, /*!< No request. */
    kI3C_RequestEmitStartAddr = 1U, /*!< Request to emit start and address on bus. */
    kI3C_RequestEmitStop      = 2U, /*!< Request to emit stop on bus. */
    kI3C_RequestIbiAckNack    = 3U, /*!< Manual IBI ACK or NACK. */
    kI3C_RequestProcessDAA    = 4U, /*!< Process DAA. */
    kI3C_RequestForceExit     = 6U, /*!< Request to force exit. */
    kI3C_RequestAutoIbi       = 7U, /*!< Hold in stopped state, but Auto-emit START,7E. */
} i3c_bus_request_t;

/*! @brief Bus type with EmitStartAddr. */
typedef enum _i3c_bus_type
{
    kI3C_TypeI3CSdr = 0U, /*!< SDR mode of I3C. */
    kI3C_TypeI2C    = 1U, /*!< Standard i2c protocol. */
    kI3C_TypeI3CDDR = 2U, /*!< HDR-DDR mode of I3C. */
} i3c_bus_type_t;

/*! @brief IBI response. */
typedef enum _i3c_ibi_response
{
    kI3C_IbiRespAck          = 0U, /*!< ACK with no mandatory byte. */
    kI3C_IbiRespNack         = 1U, /*!< NACK. */
    kI3C_IbiRespAckMandatory = 2U, /*!< ACK with mandatory byte. */
    kI3C_IbiRespManual       = 3U, /*!< Reserved. */
} i3c_ibi_response_t;

