espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_i3c.h
/* Not static so it can be used from fsl_i3c_edma.c. */
status_t I3C_MasterCheckAndClearError(I3C_Type *base, uint32_t status);

/* Not static so it can be used from fsl_i3c_edma.c. */
status_t I3C_CheckForBusyBus(I3C_Type *base);

/*!
 * @brief Set I3C module master mode.
 *
 * @param base The I3C peripheral base address.
 * @param enable Enable master mode.
 */
static inline void I3C_MasterEnable(I3C_Type *base, i3c_master_enable_t enable)
{
    base->MCONFIG = (base->MCONFIG & ~I3C_MCONFIG_MSTENA_MASK) | I3C_MCONFIG_MSTENA(enable);
}

/*@}*/

/*! @name Status */
/*@{*/

/*!
 * @brief Gets the I3C master status flags.
 *
 * A bit mask with the state of all I3C master status flags is returned. For each flag, the corresponding bit
 * in the return value is set if the flag is asserted.
 *
 * @param base The I3C peripheral base address.
 * @return State of the status flags:
 *         - 1: related status flag is set.
 *         - 0: related status flag is not set.
 * @see _i3c_master_flags
 */
static inline uint32_t I3C_MasterGetStatusFlags(I3C_Type *base)
{
    return base->MSTATUS & ~(I3C_MSTATUS_STATE_MASK | I3C_MSTATUS_IBITYPE_MASK);
}

/*!
 * @brief Clears the I3C master status flag state.
 *
 * The following status register flags can be cleared:
 * - #kI3C_MasterSlaveStartFlag
 * - #kI3C_MasterControlDoneFlag
 * - #kI3C_MasterCompleteFlag
 * - #kI3C_MasterArbitrationWonFlag
 * - #kI3C_MasterSlave2MasterFlag
 *
 * Attempts to clear other flags has no effect.
 *
 * @param base The I3C peripheral base address.
 * @param statusMask A bitmask of status flags that are to be cleared. The mask is composed of
 *  #_i3c_master_flags enumerators OR'd together. You may pass the result of a previous call to
 *  I3C_MasterGetStatusFlags().
 * @see _i3c_master_flags.
 */
static inline void I3C_MasterClearStatusFlags(I3C_Type *base, uint32_t statusMask)
{
    base->MSTATUS = statusMask;
}

/*!
 * @brief Gets the I3C master error status flags.
 *
 * A bit mask with the state of all I3C master error status flags is returned. For each flag, the corresponding bit
 * in the return value is set if the flag is asserted.
 *
 * @param base The I3C peripheral base address.
 * @return State of the error status flags:
 *         - 1: related status flag is set.
 *         - 0: related status flag is not set.
 * @see _i3c_master_error_flags
 */
static inline uint32_t I3C_MasterGetErrorStatusFlags(I3C_Type *base)
{
    return base->MERRWARN;
}

/*!
 * @brief Clears the I3C master error status flag state.
 *
 * @param base The I3C peripheral base address.
 * @param statusMask A bitmask of error status flags that are to be cleared. The mask is composed of
 *  #_i3c_master_error_flags enumerators OR'd together. You may pass the result of a previous call to
 *  I3C_MasterGetStatusFlags().
 * @see _i3c_master_error_flags.
 */
static inline void I3C_MasterClearErrorStatusFlags(I3C_Type *base, uint32_t statusMask)
{
    base->MERRWARN = statusMask;
}

/*!
 * @brief Gets the I3C master state.
 *
 * @param base The I3C peripheral base address.
 * @return I3C master state.
 */
static inline i3c_master_state_t I3C_MasterGetState(I3C_Type *base)
{
    return (i3c_master_state_t)((base->MSTATUS & I3C_MSTATUS_STATE_MASK) >> I3C_MSTATUS_STATE_SHIFT);
}

/*@}*/

/*! @name Interrupts */
/*@{*/

/*!
 * @brief Enables the I3C master interrupt requests.
 *
 * All flags except #kI3C_MasterBetweenFlag and #kI3C_MasterNackDetectFlag can be enabled as
 * interrupts.
 *
 * @param base The I3C peripheral base address.
 * @param interruptMask Bit mask of interrupts to enable. See #_i3c_master_flags for the set
 *      of constants that should be OR'd together to form the bit mask.
 */
static inline void I3C_MasterEnableInterrupts(I3C_Type *base, uint32_t interruptMask)
{
    base->MINTSET |= interruptMask;
}

/*!
 * @brief Disables the I3C master interrupt requests.
 *
 * All flags except #kI3C_MasterBetweenFlag and #kI3C_MasterNackDetectFlag can be enabled as
 * interrupts.
 *
 * @param base The I3C peripheral base address.
 * @param interruptMask Bit mask of interrupts to disable. See #_i3c_master_flags for the set
 *      of constants that should be OR'd together to form the bit mask.
 */
static inline void I3C_MasterDisableInterrupts(I3C_Type *base, uint32_t interruptMask)
{
    base->MINTCLR = interruptMask;
}

/*!
 * @brief Returns the set of currently enabled I3C master interrupt requests.
 *
 * @param base The I3C peripheral base address.
 * @return A bitmask composed of #_i3c_master_flags enumerators OR'd together to indicate the
 *      set of enabled interrupts.
 */
static inline uint32_t I3C_MasterGetEnabledInterrupts(I3C_Type *base)
{
    return base->MINTSET;
}

/*!
 * @brief Returns the set of pending I3C master interrupt requests.
 *
 * @param base The I3C peripheral base address.
 * @return A bitmask composed of #_i3c_master_flags enumerators OR'd together to indicate the
 *      set of pending interrupts.
 */
static inline uint32_t I3C_MasterGetPendingInterrupts(I3C_Type *base)
{
    return base->MINTMASKED;
}

/*@}*/

/*! @name DMA control */
/*@{*/

/*!
 * @brief Enables or disables I3C master DMA requests.
 *
 * @param base The I3C peripheral base address.
 * @param enableTx Enable flag for transmit DMA request. Pass true for enable, false for disable.
 * @param enableRx Enable flag for receive DMA request. Pass true for enable, false for disable.
 * @param width DMA read/write unit in bytes.
 */
static inline void I3C_MasterEnableDMA(I3C_Type *base, bool enableTx, bool enableRx, uint32_t width)
{
    assert(width <= 2);
    base->MDMACTRL =
        I3C_MDMACTRL_DMAFB(enableRx ? 2 : 0) | I3C_MDMACTRL_DMATB(enableTx ? 2 : 0) | I3C_MDMACTRL_DMAWIDTH(width);
}

/*!
 * @brief Gets I3C master transmit data register address for DMA transfer.
 *
 * @param base The I3C peripheral base address.
 * @param width DMA read/write unit in bytes.
 * @return The I3C Master Transmit Data Register address.
 */
static inline uint32_t I3C_MasterGetTxFifoAddress(I3C_Type *base, uint32_t width)
{
    assert(width <= 2);
    return (uint32_t)((width == 2) ? &base->MWDATAH : &base->MWDATAB);
}

/*!
 * @brief Gets I3C master receive data register address for DMA transfer.
 *
 * @param base The I3C peripheral base address.
 * @param width DMA read/write unit in bytes.
 * @return The I3C Master Receive Data Register address.
 */
static inline uint32_t I3C_MasterGetRxFifoAddress(I3C_Type *base, uint32_t width)
{
    assert(width <= 2);
    return (uint32_t)((width == 2) ? &base->MRDATAH : &base->MRDATAB);
}

/*@}*/

/*! @name FIFO control */
/*@{*/

/*!
 * @brief Sets the watermarks for I3C master FIFOs.
 *
 * @param base The I3C peripheral base address.
 * @param txLvl Transmit FIFO watermark level. The #kI3C_MasterTxReadyFlag flag is set whenever
 *      the number of words in the transmit FIFO reaches @a txLvl.
 * @param rxLvl Receive FIFO watermark level. The #kI3C_MasterRxReadyFlag flag is set whenever
 *      the number of words in the receive FIFO reaches @a rxLvl.
 * @param flushTx true if TX FIFO is to be cleared, otherwise TX FIFO remains unchanged.
 * @param flushRx true if RX FIFO is to be cleared, otherwise RX FIFO remains unchanged.
 */
static inline void I3C_MasterSetWatermarks(
    I3C_Type *base, i3c_tx_trigger_level_t txLvl, i3c_rx_trigger_level_t rxLvl, bool flushTx, bool flushRx)
{
    base->MDATACTRL = I3C_MDATACTRL_UNLOCK_MASK | I3C_MDATACTRL_TXTRIG(txLvl) | I3C_MDATACTRL_RXTRIG(rxLvl) |
                      (flushTx ? I3C_MDATACTRL_FLUSHTB_MASK : 0) | (flushRx ? I3C_MDATACTRL_FLUSHFB_MASK : 0);
}

/*!
 * @brief Gets the current number of bytes in the I3C master FIFOs.
 *
 * @param base The I3C peripheral base address.
 * @param[out] txCount Pointer through which the current number of bytes in the transmit FIFO is returned.
 *      Pass NULL if this value is not required.
 * @param[out] rxCount Pointer through which the current number of bytes in the receive FIFO is returned.
 *      Pass NULL if this value is not required.
 */
static inline void I3C_MasterGetFifoCounts(I3C_Type *base, size_t *rxCount, size_t *txCount)
{
    if (txCount)
    {
        *txCount = (base->MDATACTRL & I3C_MDATACTRL_TXCOUNT_MASK) >> I3C_MDATACTRL_TXCOUNT_SHIFT;
    }
    if (rxCount)
    {
        *rxCount = (base->MDATACTRL & I3C_MDATACTRL_RXCOUNT_MASK) >> I3C_MDATACTRL_RXCOUNT_SHIFT;
    }
}

/*@}*/

