espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_i3c.h
/*! @name Bus operations */
/*@{*/

/*!
 * @brief Sets the I3C bus frequency for master transactions.
 *
 * The I3C master is automatically disabled and re-enabled as necessary to configure the baud
 * rate. Do not call this function during a transfer, or the transfer is aborted.
 *
 * @param base The I3C peripheral base address.
 * @param baudRate_Hz Requested bus frequency in Hertz.
 * @param sourceClock_Hz I3C functional clock frequency in Hertz.
 */
void I3C_MasterSetBaudRate(I3C_Type *base, uint32_t baudRate_Hz, uint32_t sourceClock_Hz);

/*!
 * @brief Returns whether the bus is idle.
 *
 * Requires the master mode to be enabled.
 *
 * @param base The I3C peripheral base address.
 * @retval true Bus is busy.
 * @retval false Bus is idle.
 */
static inline bool I3C_MasterGetBusIdleState(I3C_Type *base)
{
    return ((base->MSTATUS & I3C_MSTATUS_STATE_MASK) == kI3C_MasterStateIdle);
}

/*!
 * @brief Sends a START signal and slave address on the I2C/I3C bus.
 *
 * This function is used to initiate a new master mode transfer. First, the bus state is checked to ensure
 * that another master is not occupying the bus. Then a START signal is transmitted, followed by the
 * 7-bit address specified in the @a address parameter. Note that this function does not actually wait
 * until the START and address are successfully sent on the bus before returning.
 *
 * @param base The I3C peripheral base address.
 * @param type The bus type to use in this transaction.
 * @param address 7-bit slave device address, in bits [6:0].
 * @param dir Master transfer direction, either #kI3C_Read or #kI3C_Write. This parameter is used to set
 *      the R/w bit (bit 0) in the transmitted slave address.
 * @param rxSize if dir is #kI3C_Read, this assigns bytes to read. Otherwise set to 0.
 * @retval #kStatus_Success START signal and address were successfully enqueued in the transmit FIFO.
 * @retval #kStatus_I3C_Busy Another master is currently utilizing the bus.
 */
status_t I3C_MasterStart(I3C_Type *base, i3c_bus_type_t type, uint8_t address, i3c_direction_t dir, uint32_t rxSize);

/*!
 * @brief Sends a repeated START signal and slave address on the I2C/I3C bus.
 *
 * This function is used to send a Repeated START signal when a transfer is already in progress. Like
 * I3C_MasterStart(), it also sends the specified 7-bit address.
 *
 * @note This function exists primarily to maintain compatible APIs between I3C and I2C drivers,
 *      as well as to better document the intent of code that uses these APIs.
 *
 * @param base The I3C peripheral base address.
 * @param type The bus type to use in this transaction.
 * @param address 7-bit slave device address, in bits [6:0].
 * @param dir Master transfer direction, either #kI3C_Read or #kI3C_Write. This parameter is used to set
 *      the R/w bit (bit 0) in the transmitted slave address.
 * @param rxSize if dir is #kI3C_Read, this assigns bytes to read. Otherwise set to 0.
 * @retval #kStatus_Success Repeated START signal and address were successfully enqueued in the transmit FIFO.
 */
status_t I3C_MasterRepeatedStart(
    I3C_Type *base, i3c_bus_type_t type, uint8_t address, i3c_direction_t dir, uint32_t rxSize);

/*!
 * @brief Performs a polling send transfer on the I2C/I3C bus.
 *
 * Sends up to @a txSize number of bytes to the previously addressed slave device. The slave may
 * reply with a NAK to any byte in order to terminate the transfer early. If this happens, this
 * function returns #kStatus_I3C_Nak.
 *
 * @param base  The I3C peripheral base address.
 * @param txBuff The pointer to the data to be transferred.
 * @param txSize The length in bytes of the data to be transferred.
 * @param flags Bit mask of options for the transfer. See enumeration #_i3c_master_transfer_flags for available options.
 * @retval #kStatus_Success Data was sent successfully.
 * @retval #kStatus_I3C_Busy Another master is currently utilizing the bus.
 * @retval #kStatus_I3C_Nak The slave device sent a NAK in response to a byte.
 * @retval #kStatus_I3C_FifoError FIFO under run or over run.
 * @retval #kStatus_I3C_ArbitrationLost Arbitration lost error.
 * @retval #kStatus_I3C_PinLowTimeout SCL or SDA were held low longer than the timeout.
 */
status_t I3C_MasterSend(I3C_Type *base, const void *txBuff, size_t txSize, uint32_t flags);

/*!
 * @brief Performs a polling receive transfer on the I2C/I3C bus.
 *
 * @param base  The I3C peripheral base address.
 * @param rxBuff The pointer to the data to be transferred.
 * @param rxSize The length in bytes of the data to be transferred.
 * @param flags Bit mask of options for the transfer. See enumeration #_i3c_master_transfer_flags for available options.
 * @retval #kStatus_Success Data was received successfully.
 * @retval #kStatus_I3C_Busy Another master is currently utilizing the bus.
 * @retval #kStatus_I3C_Nak The slave device sent a NAK in response to a byte.
 * @retval #kStatus_I3C_FifoError FIFO under run or overrun.
 * @retval #kStatus_I3C_ArbitrationLost Arbitration lost error.
 * @retval #kStatus_I3C_PinLowTimeout SCL or SDA were held low longer than the timeout.
 */
status_t I3C_MasterReceive(I3C_Type *base, void *rxBuff, size_t rxSize, uint32_t flags);

/*!
 * @brief Sends a STOP signal on the I2C/I3C bus.
 *
 * This function does not return until the STOP signal is seen on the bus, or an error occurs.
 *
 * @param base The I3C peripheral base address.
 * @retval #kStatus_Success The STOP signal was successfully sent on the bus and the transaction terminated.
 * @retval #kStatus_I3C_Busy Another master is currently utilizing the bus.
 * @retval #kStatus_I3C_Nak The slave device sent a NAK in response to a byte.
 * @retval #kStatus_I3C_FifoError FIFO under run or overrun.
 * @retval #kStatus_I3C_ArbitrationLost Arbitration lost error.
 * @retval #kStatus_I3C_PinLowTimeout SCL or SDA were held low longer than the timeout.
 */
status_t I3C_MasterStop(I3C_Type *base);

/*!
 * @brief Performs a master polling transfer on the I2C/I3C bus.
 *
 * @note The API does not return until the transfer succeeds or fails due
 * to error happens during transfer.
 *
 * @param base The I3C peripheral base address.
 * @param type The bus type to use in this transaction.
 * @param transfer Pointer to the transfer structure.
 * @retval #kStatus_Success Data was received successfully.
 * @retval #kStatus_I3C_Busy Another master is currently utilizing the bus.
 * @retval #kStatus_I3C_Nak The slave device sent a NAK in response to a byte.
 * @retval #kStatus_I3C_FifoError FIFO under run or overrun.
 * @retval #kStatus_I3C_ArbitrationLost Arbitration lost error.
 * @retval #kStatus_I3C_PinLowTimeout SCL or SDA were held low longer than the timeout.
 */
status_t I3C_MasterTransferBlocking(I3C_Type *base, i3c_bus_type_t type, i3c_master_transfer_t *transfer);

/*@}*/

